# Latihan

## Data Integration

In [1]:
import pandas as pd
import numpy as np

In [24]:
biodata = pd.DataFrame({'No': ['001', '002', '003', '004', '005'],
                     'Fakultas': ['FMKSD', 'FTI', 'FTSLK', 'FTI', 'FTSLK'],
                     'Angkatan': ['2016', '2016', '2014', '2015', '2016']})
biodata

    No Fakultas Angkatan
0  001    FMKSD     2016
1  002      FTI     2016
2  003    FTSLK     2014
3  004      FTI     2015
4  005    FTSLK     2016

In [25]:
nilai = pd.DataFrame({'No': ['001', '003', '005', '007'],
                      'Fakultas': ['FMKSD', 'FTSLK', 'FTSLK', 'FTSLK'],
                      'Nilai': [73.33, 83.83, 60.83, 90.83]})
nilai

    No Fakultas  Nilai
0  001    FMKSD  73.33
1  003    FTSLK  83.83
2  005    FTSLK  60.83
3  007    FTSLK  90.83

In [26]:
result = pd.merge(biodata, nilai, on=['No', 'Fakultas'])
result

    No Fakultas Angkatan  Nilai
0  001    FMKSD     2016  73.33
1  003    FTSLK     2014  83.83
2  005    FTSLK     2016  60.83

In [19]:
result_left = pd.merge(biodata, nilai, how='left', on=['No', 'Fakultas'])
result_left

    No Fakultas Angkatan  Nilai
0  001    FMKSD     2016  73.33
1  002      FTI     2016    NaN
2  003    FTSLK     2014  83.83
3  004      FTI     2015    NaN
4  005    FTSLK     2016  60.83

In [33]:
data['Keterangan'] = 'Lulus'
data

    No Fakultas Angkatan  Nilai Keterangan
0  001    FMKSD     2016  73.33      Lulus
1  003    FTSLK     2014  83.83      Lulus
2  005    FTSLK     2016  60.83      Lulus